src/cf/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыводаМесяца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыводаМесяцаВДатеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУказанияКПП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУказанияКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ПрограммыБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПрограммыБанка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АльфаБанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АсинхронныйОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезВК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезДопОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкОнлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FintechIntegration</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиОбменСБанками</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияПоСертификату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БанкОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяКриптография</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьДокументыБезПодписиSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаБанка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПрограммыБанка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсВходящихДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсИсходящихДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСертификатБанка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СжиматьДанныеПакетаЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодразделенияБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноАвтоматическоеПолучениеВыписки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДляПолученияВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолученияПароля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЛичногоКабинета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьОкноПодтвержденияПлатежей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйРазмерВложенийВПисьмо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияВнешнейКомпоненты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВнешняяКомпонента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбновленоПодтвердитьВБанке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсходящийДокумент</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭДОбменСБанками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутПодписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыПодписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодтвердитьВБанке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьSMS</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПодтвержденияДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПодтвержденияДокументовОбменСБанками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СертификатыПодписейОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СертификатЭП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СертификатыБанка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/БанковскиеСчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеПечатью

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеПечатью

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	( ЗначениеРазрешено(Ссылка)
	|	ИЛИ ТИПЗНАЧЕНИЯ(Владелец) = ТИП(Справочник.Контрагенты)
	|	)И( ЗначениеРазрешено(Владелец)
	|	ИЛИ ЗначениеРазрешено(Владелец)
	|	) ";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Возвращает таблица банковских счетов с переданными свойствами.
//
// Параметры:
//  - ВладелецСчета - Ссылка - ссылка на элемент-владелец
//  - ВалютаСчета - Ссылка - валюта счета
//  - Банк - Ссылка - банк
//  - ЦифровойСчет - Булево - признак цифрового счета
//
// Возвращаемое значение:
//  - ТаблицаЗначений - Таблица банковских счетов
//
Функция БанковскиеСчетаОрганизации(ВладелецСчета, ВалютаСчета, Банк = Неопределено, ЦифровойСчет = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка КАК Ссылка,
	|	БанковскиеСчета.Представление КАК Представление,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(2999, 1, 1)
	|		ИНАЧЕ БанковскиеСчета.ДатаЗакрытия
	|	КОНЕЦ КАК ДатаЗакрытияДляУпорядочивания,
	|	ВЫБОР
	|		КОГДА СправочникВладелец.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Основной
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК СправочникВладелец
	|		ПО БанковскиеСчета.Владелец = СправочникВладелец.Ссылка
	|			И БанковскиеСчета.Ссылка = СправочникВладелец.БанковскийСчетПоУмолчанию
	|ГДЕ
	|	БанковскиеСчета.Владелец = &ВладелецСчета
	|	И НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.ВалютаДенежныхСредств = &Валюта
	|	И БанковскиеСчета.Банк = &Банк
	|	// И БанковскиеСчета.ЦифровойСчет = &ЦифровойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основной УБЫВ,
	|	ДатаЗакрытияДляУпорядочивания УБЫВ,
	|	Представление";
	
	Если ТипЗнч(ВладелецСчета) = Тип("СправочникСсылка.Контрагенты") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Организации", "Справочник.Контрагенты");
	КонецЕсли;
	
	Если Банк = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "БанковскиеСчета.Банк = &Банк", "ИСТИНА");
	КонецЕсли;
	
	Если ЦифровойСчет = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "БанковскиеСчета.ЦифровойСчет = &ЦифровойСчет", "ИСТИНА");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВладелецСчета", ВладелецСчета);
	Запрос.УстановитьПараметр("Валюта",        ВалютаСчета);
	Запрос.УстановитьПараметр("Банк",          Банк); 
	Запрос.УстановитьПараметр("ЦифровойСчет",  ЦифровойСчет);

	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получает ссылку на элемент справочника с переданными свойствами.
// Если элемент с таким набором свойств отсутствует в справочнике,
// он автоматически создается.
//
// Параметры:
//  - Владелец - Ссылка - ссылка на элемент-владелец
//  - НомерСчета - Строка - номер банковского счета
//  - БИК        - Строка - БИК банка
//
// Возвращаемое значение:
//  - Ссылка - ссылка на элемент справочника
//
Функция ПолучитьЭлемент(Знач Владелец, Знач НомерСчета, Знач БИК) Экспорт
	
	Результат = ПустаяСсылка();
	
	// Поиск существующего банковского счета по номеру и БИК
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец",   Владелец);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	Запрос.УстановитьПараметр("БИК",        БИК);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И БанковскиеСчета.НомерСчета = &НомерСчета
	|	И БанковскиеСчета.Банк.Код = &БИК";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Если Результат.Пустая() Тогда
		
		ДанныеБанковскогоСчета = Новый Структура;
		ДанныеБанковскогоСчета.Вставить("Владелец",   Владелец);
		ДанныеБанковскогоСчета.Вставить("НомерСчета", НомерСчета);
		ТаблицаБанков = Справочники.Банки.ПолучитьТаблицуБанковПоРеквизитам("Код", БИК);
		ДанныеБанковскогоСчета.Вставить("ВалютаДенежныхСредств", Константы.НациональнаяВалюта.Получить());
		ДанныеБанковскогоСчета.Вставить("Банк",
			?(ТаблицаБанков.Количество()>0, ТаблицаБанков[0].Ссылка, Справочники.Банки.ПустаяСсылка()));
		
		БанковскийСчетКонтрагента = СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(БанковскийСчетКонтрагента,ДанныеБанковскогоСчета ); 
		БанковскийСчетКонтрагента.Заполнить(ДанныеБанковскогоСчета);
		БанковскийСчетКонтрагента.Наименование = СтрШаблон(
			НСтр("ru = '%1, в %2'"),
			СокрЛП(БанковскийСчетКонтрагента.НомерСчета),
			БанковскийСчетКонтрагента.Банк);

		БанковскийСчетКонтрагента.Записать();
		
		Результат = БанковскийСчетКонтрагента.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция БанковскийСчетСубъекта(СубъектХозДеятельности, ВалютаДенежныхСредств = Неопределено,
		РабочаяДата = Неопределено, Договор = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Договор) И ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		БанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "БанковскийСчетПоУмолчанию");
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			Возврат БанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(СубъектХозДеятельности) <> Тип("СправочникСсылка.Организации")
		И ТипЗнч(СубъектХозДеятельности) <> Тип("СправочникСсылка.Контрагенты")
		И ТипЗнч(СубъектХозДеятельности) <> Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СубъектХозДеятельности", СубъектХозДеятельности);
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("ИгнорироватьПроверкуВалюты", НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств));
	Запрос.УстановитьПараметр("РабочаяДата", РабочаяДата);
	Запрос.УстановитьПараметр("ИгнорироватьДатуЗакрытия", НЕ ЗначениеЗаполнено(РабочаяДата));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БанковскиеСчета.Владелец.БанковскийСчетПоУмолчанию КАК БанковскийСчет,
	|	БанковскиеСчета.Владелец.БанковскийСчетПоУмолчанию.ДатаОткрытия КАК ДатаОткрытия,
	|	0 КАК Порядок
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &СубъектХозДеятельности
	|	И (БанковскиеСчета.Владелец.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = &ВалютаДенежныхСредств
	|			ИЛИ &ИгнорироватьПроверкуВалюты)
	|	И (БанковскиеСчета.Владелец.БанковскийСчетПоУмолчанию.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ БанковскиеСчета.Владелец.БанковскийСчетПоУмолчанию.ДатаЗакрытия >= &РабочаяДата
	|			ИЛИ &ИгнорироватьДатуЗакрытия)
	|	И БанковскиеСчета.Владелец.БанковскийСчетПоУмолчанию.Недействителен = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка,
	|	БанковскиеСчета.ДатаОткрытия,
	|	1
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &СубъектХозДеятельности
	|	И БанковскиеСчета.Ссылка <> БанковскиеСчета.Владелец.БанковскийСчетПоУмолчанию
	|	И (БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств
	|			ИЛИ &ИгнорироватьПроверкуВалюты)
	|	И (БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ БанковскиеСчета.ДатаЗакрытия >= &РабочаяДата
	|			ИЛИ &ИгнорироватьДатуЗакрытия)
	|	И БанковскиеСчета.Недействителен = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ДатаОткрытия";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.БанковскийСчет, Справочники.БанковскиеСчета.ПустаяСсылка());
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	Если Не Параметры.Отбор.Свойство("Недействителен") Тогда
		Параметры.Отбор.Вставить("Недействителен", Ложь);
	КонецЕсли;
КонецПроцедуры

Функция БанковскийСчетПоРеквизитам(Владелец, Банк, НомерСчета) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Банк = &Банк
	|	И БанковскиеСчета.НомерСчета = &НомерСчета
	|	И БанковскиеСчета.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	БанковскиеСчета.ПометкаУдаления,
	|	БанковскиеСчета.Ссылка");
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(БанковскиеПравила.МаксимальнаяДлинаМеждународногоНомераСчета());
	ПриведенныйНомерСчета = ТипСтрока.ПривестиЗначение(НомерСчета);
	Запрос.УстановитьПараметр("НомерСчета", ПриведенныйНомерСчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает реквизиты банковского счета - номер счета, БИК банка, вид счета, дата открытия и закрытия счета.
//
// Параметры:
//   БанковскийСчет - СправочникСсылка.БанковскиеСчета - ссылка на счет.
//
// Возвращаемое значение:
//   - Структура - реквизиты счета.
//   - Неопределено - если счет не найден.
//
Функция РеквизитыСчета(БанковскийСчет) Экспорт
	
	Если Не ЗначениеЗаполнено(БанковскийСчет) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк.Код КАК БИКБанка,
	|	БанковскиеСчета.Банк.Наименование КАК НаименованиеБанка,
	|	БанковскиеСчета.ВидСчета КАК ВидСчета,
	|	БанковскиеСчета.ДатаОткрытия КАК ДатаОткрытия,
	|	БанковскиеСчета.ДатаЗакрытия КАК ДатаЗакрытия
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка = &БанковскийСчет";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает количество банковских счетов организации.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация.
//
// Возвращаемое значение:
//   - Число - количество банковских счетов организации.
//
Функция КоличествоБанковскихСчетовОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	Иначе
		Количество = 0;
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПрямойОбменСБанком

Функция БанкиИНастройкиСПрямымОбменом(Организация) Экспорт
	
	Настройки = Новый Соответствие;
	Для Каждого СчетНастройка Из БанковскиеСчетаСНастройкамиПрямогоОбмена(Организация) Цикл
		Если Настройки[СчетНастройка.Банк] = Неопределено Тогда
			Настройки.Вставить(СчетНастройка.Банк, СчетНастройка.НастройкаОбмена);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

Функция БанковскиеСчетаСНастройкамиПрямогоОбмена(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Банки.Ссылка КАК Банк,
	|	БанковскиеСчета.Ссылка КАК БанковскийСчет,
	|	Банки.Код КАК БИК,
	|	ЕСТЬNULL(НастройкиОбменСБанками.Ссылка, НастройкиОбменСБанкамиПоБИК.Ссылка) КАК НастройкаОбмена,
	|	ВЫБОР
	|		КОГДА НастройкиОбменСБанками.ПрограммаБанка = ЗНАЧЕНИЕ(Перечисление.ПрограммыБанка.СбербанкОнлайн)
	|			ТОГДА 0
	|		КОГДА НастройкиОбменСБанкамиПоБИК.ПрограммаБанка = ЗНАЧЕНИЕ(Перечисление.ПрограммыБанка.СбербанкОнлайн)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО БанковскиеСчета.Банк = Банки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
	|		ПО БанковскиеСчета.Банк = НастройкиОбменСБанками.Банк
	|			И (НастройкиОбменСБанками.Организация = &Организация)
	|			И (НЕ НастройкиОбменСБанками.ПометкаУдаления)
	|			И (НЕ НастройкиОбменСБанками.Недействительна)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанкамиПоБИК
	|		ПО (Банки.Код = НастройкиОбменСБанкамиПоБИК.Банк.Код)
	|			И (НастройкиОбменСБанкамиПоБИК.Организация = &Организация)
	|			И (НЕ НастройкиОбменСБанкамиПоБИК.ПометкаУдаления)
	|			И (НЕ НастройкиОбменСБанкамиПоБИК.Недействительна)
	|ГДЕ
	|	НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|	И БанковскиеСчета.Владелец = &Организация
	|	И (НастройкиОбменСБанками.Ссылка ЕСТЬ НЕ NULL 
	|			ИЛИ НастройкиОбменСБанкамиПоБИК.Ссылка ЕСТЬ НЕ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	БИК";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция БанковскиеСчетаБезПрямогоОбмена(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.Ссылка КАК БанковскийСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО БанковскиеСчета.Банк = Банки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
	|		ПО БанковскиеСчета.Банк = НастройкиОбменСБанками.Банк
	|			И (БанковскиеСчета.Владелец = &Организация)
	|			И (НЕ НастройкиОбменСБанками.ПометкаУдаления)
	|			И (НЕ НастройкиОбменСБанками.Недействительна)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанкамиПоБИК
	|		ПО (Банки.Код = НастройкиОбменСБанками.Банк.Код)
	|			И (БанковскиеСчета.Владелец = &Организация)
	|			И (НЕ НастройкиОбменСБанкамиПоБИК.ПометкаУдаления)
	|			И (НЕ НастройкиОбменСБанкамиПоБИК.Недействительна)
	|ГДЕ
	|	НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|	И БанковскиеСчета.Владелец = &Организация
	|	И НастройкиОбменСБанками.Ссылка ЕСТЬ NULL
	|	И НастройкиОбменСБанкамиПоБИК.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Банки.Код";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает соответствие БИК банков банковских счетов организации с информацией о настройке прямого обмена. 
//
// Параметры:
//  Организация - СправочникСсылка.Организации - ссылка на организацию.
//
// Возвращаемое значение:
//  Соответствие - Ключ - БИК банка, 
//                 Значение - Структура - см. Справочники.БанковскиеСчета.ИнформацияОНастройкеПрямогоОбмена.
//
Функция БИКБанковСИнформациейОНастройкеПрямогоОбмена(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Банки.Код КАК БИК,
	|	ВЫБОР
	|		КОГДА НастройкиОбменСБанками.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ НастройкиОбменСБанкамиПоБИК.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтатусДиректБанк
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО БанковскиеСчета.Банк = Банки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
	|		ПО БанковскиеСчета.Банк = НастройкиОбменСБанками.Банк
	|			И (НастройкиОбменСБанками.Организация = &Организация)
	|			И (НЕ НастройкиОбменСБанками.ПометкаУдаления)
	|			И (НЕ НастройкиОбменСБанками.Недействительна)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанкамиПоБИК
	|		ПО (Банки.Код = НастройкиОбменСБанкамиПоБИК.Банк.Код)
	|			И (НастройкиОбменСБанкамиПоБИК.Организация = &Организация)
	|			И (НЕ НастройкиОбменСБанкамиПоБИК.ПометкаУдаления)
	|			И (НЕ НастройкиОбменСБанкамиПоБИК.Недействительна)
	|ГДЕ
	|	НЕ БанковскиеСчета.ПометкаУдаления
	|	И БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|	И БанковскиеСчета.Владелец = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	Банки.Код,
	|	ВЫБОР
	|		КОГДА НастройкиОбменСБанками.Ссылка ЕСТЬ НЕ NULL 
	|				ИЛИ НастройкиОбменСБанкамиПоБИК.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА Истина
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	БИК";
	
	Результат = Новый Соответствие;
    БИКБанковДляПроверки = Новый Соответствие;
	
	УстановитьПривилегированныйРежим(Истина);	
			
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл
		
		ИнформацияОНастройкеПрямогоОбмена = СведенияОНастройкеПрямогоОбмена();
		
		ИнформацияОНастройкеПрямогоОбмена.БИК = ВыборкаРезультат.БИК;
		ИнформацияОНастройкеПрямогоОбмена.Настройка = ВыборкаРезультат.СтатусДиректБанк;
		ИнформацияОНастройкеПрямогоОбмена.Рублевый = Ложь;
		ИнформацияОНастройкеПрямогоОбмена.Валютный = Ложь;
		
		БИКБанковДляПроверки.Вставить(ВыборкаРезультат.БИК, ИнформацияОНастройкеПрямогоОбмена);

	КонецЦикла;
	
	// Не для всех БИК банков могли существовать настройки
	// проверяем по макетам возможность прямого обмена
	Для ИндексМакета = 0 По 1 Цикл
		
		Если БИКБанковДляПроверки.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		Если ИндексМакета = 0 Тогда 
			ТекущийМакет = ОбменСБанкамиСлужебныйПовтИсп.СписокБанков();
		Иначе
			ТекущийМакет = УчетДенежныхСредствПовтИсп.СписокБанковСВалютнойВыпиской();	
		КонецЕсли;
		
		КоличествоЗаписей = ТекущийМакет.ВысотаТаблицы;
		
		// Первая строка в макете - заголовок	
		Для Индекс = 2 По КоличествоЗаписей Цикл
			
			БИКБанка = ТекущийМакет.Область(Индекс, 2).Текст;
			ИнформацияОНастройкеПрямогоОбмена = БИКБанковДляПроверки.Получить(БИКБанка);
			Если ИнформацияОНастройкеПрямогоОбмена <> Неопределено Тогда
				
				ПроектыВФайлеСтрокой = ТекущийМакет.Область(Индекс, 8).Текст;
				Если ЗначениеЗаполнено(ПроектыВФайлеСтрокой) Тогда 
					МассивПроектовВФайле = СтрРазделить(ПроектыВФайлеСтрокой, ",", Ложь);
					Для каждого ТекПроект из МассивПроектовВФайле Цикл
						Проект = СокрЛП(ТекПроект);
						Если Проект = "1" Тогда
							ИнформацияОНастройкеПрямогоОбмена.Рублевый = Истина;
						ИначеЕсли Проект = "3" Тогда
							ИнформацияОНастройкеПрямогоОбмена.Валютный = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ИнформацияОНастройкеПрямогоОбмена.Рублевый ИЛИ ИнформацияОНастройкеПрямогоОбмена.Валютный Тогда
					Результат.Вставить(БИКБанка, ИнформацияОНастройкеПрямогоОбмена);
					БИКБанковДляПроверки.Удалить(БИКБанка);
				КонецЕсли;
				
				Если БИКБанковДляПроверки.Количество() = 0 Тогда
					Прервать;	
				КонецЕсли;
								
			КонецЕсли;
			
		КонецЦикла;	
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

// Возвращает структуру с информацией о настройке прямого обмена с банком
//
// Параметры:
//  Организация - СправочникСсылка.Орагнизации - ссылка на организацию
//  Банк - СправочникСсылка.Банки - ссылка на банк
//
// Возвращаемое значение:
//   Структура - см. Справочники.БанковскиеСчета.ПараметрыНастройкиПрямогоОбмена
//
Функция ИнформацияОНастройкеПрямогоОбменаСБанком(Организация, Банк) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьНастройкаПрямогоОбмена = ЗначениеЗаполнено(ОбменСБанками.НастройкаОбмена(Организация, Банк));
	БИКБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Код");
	ИнформацияОНастройкеПрямогоОбмена = СведенияОНастройкеПрямогоОбмена();
	ИнформацияОНастройкеПрямогоОбмена.Настройка = ЕстьНастройкаПрямогоОбмена;
	ИнформацияОНастройкеПрямогоОбмена.БИК = БИКБанка;
	
	Для ИндексМакета = 0 По 1 Цикл
		
		Если ИнформацияОНастройкеПрямогоОбмена.Рублевый ИЛИ ИнформацияОНастройкеПрямогоОбмена.Валютный Тогда
			Прервать;
		КонецЕсли;
		Если ИндексМакета = 0 Тогда 
			ТекущийМакет = ОбменСБанкамиСлужебныйПовтИсп.СписокБанков();
		Иначе
			ТекущийМакет = УчетДенежныхСредствПовтИсп.СписокБанковСВалютнойВыпиской();	
		КонецЕсли;
		
		КоличествоЗаписей = ТекущийМакет.ВысотаТаблицы;
		
		// Первая строка в макете - заголовок	
		Для Индекс = 2 По КоличествоЗаписей Цикл
			
			Если ИнформацияОНастройкеПрямогоОбмена.БИК = ТекущийМакет.Область(Индекс, 2).Текст Тогда
				
				ПроектыВФайлеСтрокой = ТекущийМакет.Область(Индекс, 8).Текст;
				Если ЗначениеЗаполнено(ПроектыВФайлеСтрокой) Тогда 
					МассивПроектовВФайле = СтрРазделить(ПроектыВФайлеСтрокой, ",", Ложь);
					Для каждого ТекПроект из МассивПроектовВФайле Цикл
						Проект = СокрЛП(ТекПроект);
						Если Проект = "1" Тогда
							ИнформацияОНастройкеПрямогоОбмена.Рублевый = Истина;
						ИначеЕсли Проект = "3" Тогда
							ИнформацияОНастройкеПрямогоОбмена.Валютный = Истина;
						КонецЕсли;
					КонецЦикла;		
				КонецЕсли;
				
				Если ИнформацияОНастройкеПрямогоОбмена.Рублевый ИЛИ ИнформацияОНастройкеПрямогоОбмена.Валютный Тогда
					Прервать;
				КонецЕсли;
												
			КонецЕсли;
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат ИнформацияОНастройкеПрямогоОбмена; 
	
КонецФункции

// Формирует структуру информации о настройке прямого обмена.
//
// Возвращаемое значение:
//   Структура - содержит поля:
//     * БИК - Строка - БИК Банка.
//     * Настройка - Булево - если Истина, то есть действующая настройка прямого обмена.
//     * Рублевый - Булево - если Истина, то возможен обмен рублевыми платежными документами.
//     * Валютный - Булево - если Истина, то возможен обмен валютными платежными документами.
//
Функция СведенияОНастройкеПрямогоОбмена()
	
	Результат = Новый Структура;
	Результат.Вставить("БИК", "");
	Результат.Вставить("Настройка", Ложь);
	Результат.Вставить("Рублевый", Ложь);
	Результат.Вставить("Валютный", Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
